# Задача 4: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no

m = int(input("количество долек у шоколадки в длину: "))
n = int(input("Количество долек у шоколадки в ширину: "))
k = int(input("Вы можете отломить себе прямоугольную дольку. Сколько долек Вы хотите отломить? "))


if k < m*n and (k % m == 0 or k % n == 0):
    print('Да! Вы разломили шоколад на 2 прямоугольника!')
else:
    print('К сожалению, Вам не удастся отломить столько кусочков.')