# Задача 3: Вы пользуетесь общественным транспортом?
# Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

number = input("Введите номер Вашего билета: ")
sum_1 = 0
sum_2 = 0
for i in number[3:6]:
    sum_1 += int(i)
print (sum_1)
for i in number[:3]:
    sum_2 += int(i)
print (sum_2)
if sum_1 == sum_2:
    print("Ваш билет счастлвый! Поздравляю!")
else:
    print("К сожалению, Вам не повезло!")