# Задача 11
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.
# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

import random
set = []
set_1 = []
set_2 = []
n = int(input("Введите длину первого множества: "))
m = int(input("Введите длину второго множества: "))

for x in range(n):
    set_1.append(random.randint(1, 101))
print(set_1)

for y in range(m):
    set_2.append(random.randint(1, 101))
print(set_2)

for x in set_1:
    for y in set_2:
        if x == y:
            set.append(x)
            set.sort()
print(set)

