# Задача 5:
# На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть.
# Пример:
# 5 -> 1 0 1 1 0

import random
n = int(input(" Введите количество монет, лежащих на столе: "))
coins = []
k = 0
m = 0
for i in range(n):
    coins.append(random.randint(0,1))

    if coins[i] == 1:
        k += 1
    else:
        m += 1
if k > m:
    print(f'Минимально нужно перевернуть {m} монеты')
else:
    print(f'Минимально нужно перевернуть {k} монеты')
print(coins)


