# Задача 9.
# Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X.
# Пример
# 5
# 1 2 3 4 5
# 6
# -> 5

import random
arr = []
n = int(input("Введите длину массива: "))

for i in range(n):
    arr.append(random.randint(1, 10))
print(arr)

x = int(input("Задайте число Х: "))
for i in range(len(arr)):
    if arr[i] == x and (arr[i] - arr[i-1]) > (arr[i+1] - arr[i]):
        print(f'Ближайшее число к {x} в списке {arr[i+1]}')
    elif arr[i] == x and (arr[i] - arr[i-1]) < (arr[i+1] - arr[i]):
        print(f'Ближайшее число к {x} в списке {arr[i-1]}')
